In [29]:
#importing sql
import sqlite3

In [30]:
#connecting the database
conn = sqlite3.connect('test.db')
#creating cursor object
cur = conn.cursor()

In [31]:
#connecting to magic sql
%sql sqlite:///test.db

In [32]:
import pandas as pd
#loading dataset
df =pd.read_csv('/content/world_cities.csv')
print(df)

        city_name  avg_temp  avg_commute  happiness_ranking
0          Boston        62           55                 27
1    Buenos Aires        70           60                  7
2          Sydney        72           69                  6
3           Tokyo        60           70                 26
4     Los Angeles        70          100                 20
5   San Francisco        65           80                 21
6         Beijing        64           50                 22
7          Zurich        65           45                 23
8        Shanghai        70           80                  3
9           Dubai        80           55                 24
10         London        59           45                 25
11         Dublin        60           45                  8
12      New Delhi        80           60                  4
13          Perth        68           38                 19
14        Chicago        58           55                 18
15        Seattle        60           48                 17
16        Toronto        60           50                  2
17    Mexico City        70           30                 16
18         Berlin        68           40                 13
19      Cape Town        72           48                 14
20          Lagos        80           38                  5
21    Panama City        80           40                 15
22      Singapore        75           40                 12
23         Jakata        78           35                 10
24          Seoul        60           90                  9
25        Phoenix        70           45                 11
26      Amsterdam        67           20                  1

In [33]:
#changing the df to sql form
df.to_sql('world_cities', conn, if_exists='replace', index=False)

27

In [35]:
#start using sql
%sql SELECT * FROM world_cities limit 10

   sqlite:///new1.db
 * sqlite:///test.db
Done.

[('Boston', 62, 55, 27),
 ('Buenos Aires', 70, 60, 7),
 ('Sydney', 72, 69, 6),
 ('Tokyo', 60, 70, 26),
 ('Los Angeles', 70, 100, 20),
 ('San Francisco', 65, 80, 21),
 ('Beijing', 64, 50, 22),
 ('Zurich', 65, 45, 23),
 ('Shanghai', 70, 80, 3),
 ('Dubai', 80, 55, 24)]

In [36]:
#inserting values
%%sql
insert into world_cities
values('Chennai',73,65,58);
select * from world_cities;

   sqlite:///new1.db
 * sqlite:///test.db
1 rows affected.
Done.

[('Boston', 62, 55, 27),
 ('Buenos Aires', 70, 60, 7),
 ('Sydney', 72, 69, 6),
 ('Tokyo', 60, 70, 26),
 ('Los Angeles', 70, 100, 20),
 ('San Francisco', 65, 80, 21),
 ('Beijing', 64, 50, 22),
 ('Zurich', 65, 45, 23),
 ('Shanghai', 70, 80, 3),
 ('Dubai', 80, 55, 24),
 ('London', 59, 45, 25),
 ('Dublin', 60, 45, 8),
 ('New Delhi', 80, 60, 4),
 ('Perth', 68, 38, 19),
 ('Chicago', 58, 55, 18),
 ('Seattle', 60, 48, 17),
 ('Toronto', 60, 50, 2),
 ('Mexico City', 70, 30, 16),
 ('Berlin', 68, 40, 13),
 ('Cape Town', 72, 48, 14),
 ('Lagos', 80, 38, 5),
 ('Panama City', 80, 40, 15),
 ('Singapore', 75, 40, 12),
 ('Jakata', 78, 35, 10),
 ('Seoul', 60, 90, 9),
 ('Phoenix', 70, 45, 11),
 ('Amsterdam', 67, 20, 1),
 ('Chennai', 73, 65, 58)]

In [43]:
#print city with lowest happiness ranking
%%sql
select city_name, happiness_ranking from world_cities order by happiness_ranking desc limit 1;

   sqlite:///new1.db
 * sqlite:///test.db
Done.

[('Chennai', 58)]